Extensions/АБ/Enums/УВМ_ВариантыДоговоров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>УВМ_ВариантыДоговоров</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>АгентскийДоговор</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГОЗы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГОСы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДоговорАрендыОфиса</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДоговорАрендыСкладскихПомещений</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДоговорБанковскойГарантии</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДоговорЗалога</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДоговорЛизинга</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДоговорОбщехозяйственныхУслуг</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДоговорОказанияУслугПеревозкиГрузов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДоговорОТХ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДоговорПоручительства</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДоговорПоставки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДоговорСубсидирования</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДоговорТЭУ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДоговорЦессии</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МеждународныйДоговорКуплиПродажи</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СоглашениеОбЭДО</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Extensions/АБ/CommonModules/УВМ_ПовтИсп/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

//++dar 29.04.26 (326008)
// Возвращает список (массив) наименований сторон договора для указанного типа документа.
//
// Параметры:
//  - ТипДокумента: ПеречислениеСсылка.УВМ_ВариантыДоговоров. Тип договора/документа, для которого требуется получить стороны.
//    Если передано значение другого типа — возвращается пустой массив.
//
// Возвращаемое значение:
//  - Массив. Список ссылок на элементы справочника `Справочники.НаименованияСторон`, соответствующих сторонам договора.
//    Если для типа документа стороны не определены — возвращается пустой массив.
Функция НаименованияСторонПоТипуДокумента(ТипДокумента) Экспорт
	
	Если ТипЗнч(ТипДокумента) <> Тип("ПеречислениеСсылка.УВМ_ВариантыДоговоров") Тогда
		Возврат Новый Массив;
	КонецЕсли;
	
	СтороныДокумента = Новый Соответствие;                                                          
	
	ДобавитьСторонуДокумента(СтороныДокумента, "Поставщик, Покупатель", "ДоговорПоставки, ГОСы, ГОЗы");
	ДобавитьСторонуДокумента(СтороныДокумента, "Арендатор, Арендодатель", "ДоговорАрендыОфиса, ДоговорАрендыСкладскихПомещений, СоглашениеОбЭДО");
	ДобавитьСторонуДокумента(СтороныДокумента, "Грузовладелец, Перевозчик, Исполнитель, Заказчик", "ДоговорТЭУ");
	ДобавитьСторонуДокумента(СтороныДокумента, "Залогодатель, Залогодержатель", "ДоговорЗалога");
	ДобавитьСторонуДокумента(СтороныДокумента, "Гарант, Бенефициар, Принципал", "ДоговорБанковскойГарантии");
	ДобавитьСторонуДокумента(СтороныДокумента, "Перевозчик, Заказчик", "ДоговорОказанияУслугПеревозкиГрузов"); 
	ДобавитьСторонуДокумента(СтороныДокумента, "Поклажедатель, Хранитель", "ДоговорОТХ");
	ДобавитьСторонуДокумента(СтороныДокумента, "Поставщик, Покупатель", "МеждународныйДоговорКуплиПродажи");
	ДобавитьСторонуДокумента(СтороныДокумента, "Принципал, Агент", "АгентскийДоговор");
	ДобавитьСторонуДокумента(СтороныДокумента, "Поручитель, Кредитор", "ДоговорПоручительства");
	ДобавитьСторонуДокумента(СтороныДокумента, "Лизингодатель, Лизингополучатель, Продавец", "ДоговорЛизинга");
	ДобавитьСторонуДокумента(СтороныДокумента, "Цедент, Цессионарий", "ДоговорЦессии");
	ДобавитьСторонуДокумента(СтороныДокумента, "Предоставитель (Распорядитель), Получатель", "ДоговорСубсидирования");
	ДобавитьСторонуДокумента(СтороныДокумента, "Заказчик, Исполнитель", "ДоговорОбщехозяйственныхУслуг"); 
	
	МассивСторон = СтороныДокумента.Получить(ТипДокумента);
	
	Если МассивСторон = Неопределено Тогда
		МассивСторон = Новый Массив;
	КонецЕсли;                      
	
	Возврат МассивСторон;
	
КонецФункции
//--dar 29.04.26 (326008)

#КонецОбласти  

#Область СлужебныеПроцедурыИФункции

//++dar 29.04.26 (326008)
// Добавляет в соответствие `Результат` сопоставление "тип договора → стороны договора".
// Параметры:
//  - Результат: Соответствие. Ключ — значение перечисления `Перечисления.УВМ_ВариантыДоговоров`, значение — Массив ссылок на `Справочники.НаименованияСторон`.
//  - НаименованияСторон: Строка. Список наименований сторон, разделённых запятыми.
//  - ТипыДоговора: Строка. Список типов договора (имена элементов перечисления), разделённых запятыми.
Процедура ДобавитьСторонуДокумента(Результат, НаименованияСторон, ТипыДоговора)
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Стороны = СтрРазделить(НаименованияСторон, ",", Ложь);
	Типы = СтрРазделить(ТипыДоговора, ",", Ложь);
	
	МассивНаименований = Новый Массив;
	Для Каждого ТекСторона Из Стороны Цикл
		ИмяСтороны = СокрЛП(ТекСторона);
		Если ПустаяСтрока(ИмяСтороны) Тогда
			Продолжить;
		КонецЕсли;
		
		СсылкаСтороны = Справочники.НаименованияСторон.НайтиПоНаименованию(ИмяСтороны, Истина);
		Если Не СсылкаСтороны.Пустая() Тогда
			МассивНаименований.Добавить(СсылкаСтороны); 
		Иначе 
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрШаблон("В справочнике 'Наименования сторон' не найден элемент %1", ИмяСтороны));
		КонецЕсли;
		
	КонецЦикла;
	
	Для Каждого ТекТип Из Типы Цикл
		ИмяТипа = СокрЛП(ТекТип);
		Если ПустаяСтрока(ИмяТипа) Тогда
			Продолжить;
		КонецЕсли;
		
		Попытка
			КлючТипаДоговора = Перечисления.УВМ_ВариантыДоговоров[ИмяТипа];
		Исключение
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрШаблон("Нет значения перечисления 'Варианты договоров' %1", ИмяТипа));
			Продолжить;
		КонецПопытки;
		
		Результат.Вставить(КлючТипаДоговора, МассивНаименований);
		
	КонецЦикла;	
	
КонецПроцедуры
//--dar 29.04.26 (326008)

#КонецОбласти
